using System;

namespace gb_hw_oop5
{
    class Program
    {
        static void Main(string[] args)
        {
            var a = new Fraction(1, 2);
            var a1 = new Fraction(1, 2);
            var b = new Fraction(2, 16);
            var b1 = new Fraction(1, 8);
            var c = new Fraction(9, 2);
            var c1 = new Fraction(1, 20);

            Console.WriteLine($"Проверка операторов:\n" +
                $"Проверка на равенство дробей: {a} и {a1}. Результат: {a == a1}\n" +
                $"Проверка на равенство дробей: {b} и {b1}. Результат: {b == b1}\n" +
                $"Проверка на равенство дробей: {c} и {c1}. Результат: {c == c1}\n" +
                $"Проверка на неравенство дробей: {a} и {a1}. Результат: {a != a1}\n" +
                $"Проверка на неравенство дробей: {b} и {b1}. Результат: {b != b1}\n" +
                $"Проверка на неравенство дробей: {c} и {c1}. Результат: {c != c1}\n" +
                $"Сравнение знаком > дробей: {a} и {a1}. Результат: {a > a1}\n" +
                $"Сравнение знаком > дробей: {b} и {b1}. Результат: {b > b1}\n" +
                $"Сравнение знаком > дробей: {c} и {c1}. Результат: {c > c1}\n" +
                $"Сравнение знаком < дробей: {a} и {a1}. Результат: {a < a1}\n" +
                $"Сравнение знаком < дробей: {b} и {b1}. Результат: {b < b1}\n" +
                $"Сравнение знаком < дробей: {c} и {c1}. Результат: {c < c1}\n" +
                $"Сравнение знаком >= дробей: {a} и {a1}. Результат: {a >= a1}\n" +
                $"Сравнение знаком >= дробей: {b} и {b1}. Результат: {b >= b1}\n" +
                $"Сравнение знаком >= дробей: {c} и {c1}. Результат: {c >= c1}\n" +
                $"Сравнение знаком <= дробей: {a} и {a1}. Результат: {a <= a1}\n" +
                $"Сравнение знаком <= дробей: {b} и {b1}. Результат: {b <= b1}\n" +
                $"Сравнение знаком <= дробей: {c} и {c1}. Результат: {c <= c1}\n") ;

            Console.WriteLine($"Сложение дробей {a} и {a1}. Результат: {a + a1}");
            Console.WriteLine($"Сложение дробей {b} и {b1}. Результат: {b + b1}");
            Console.WriteLine($"Сложение дробей {c} и {c1}. Результат: {c + c1}");

            Console.WriteLine($"Вычитание дробей {a} и {a1}. Результат: {a - a1}");
            Console.WriteLine($"Вычитание дробей {b} и {b1}. Результат: {b - b1}");
            Console.WriteLine($"Вычитание дробей {c} и {c1}. Результат: {c - c1}");

            //Console.WriteLine($"Инкремент дроби {a}. Результат: {++a}");
            //Console.WriteLine($"Инкремент дроби {b}. Результат: {++b}");
            //Console.WriteLine($"Инкремент дроби {c}. Результат: {++c}");

            //Console.WriteLine($"Декремент дроби {a1}. Результат: {--a1}");
            //Console.WriteLine($"Декремент дроби {b1}. Результат: {--b1}");
            //Console.WriteLine($"Декремент дроби {c1}. Результат: {--c1}");


            Console.WriteLine($"Не явное приведение дроби {a} к float. Результат: {a /1.0f}");
            Console.WriteLine($"Не явное приведение дроби {b} к float. Результат: {b / 1.0f}");
            Console.WriteLine($"Не явное приведение дроби {c} к float. Результат: {c / 1.0f}");

            Console.WriteLine($"Явное приведение дроби {a} к int. Результат: {(int)a}");
            Console.WriteLine($"Явное приведение дроби {b} к int. Результат: {(int)b}");
            Console.WriteLine($"Явное приведение дроби {c} к int. Результат: {(int)c}");

            Console.WriteLine($"Умножение дробей {a} и {a1}. Результат: {a * a1}");
            Console.WriteLine($"Умножение дробей {b} и {b1}. Результат: {b * b1}");
            Console.WriteLine($"Умножение дробей {c} и {c1}. Результат: {c * c1}");

            Console.WriteLine($"Деление дробей {a} и {a1}. Результат: {a / a1}");
            Console.WriteLine($"Деление дробей {b} и {b1}. Результат: {b / b1}");
            Console.WriteLine($"Деление дробей {c} и {c1}. Результат: {c / c1}");

            Console.WriteLine($"Остаток от деления дробей {a} и {a1}. Результат: {a % a1}");
            Console.WriteLine($"Остаток от деления дробей {b} и {b1}. Результат: {b % b1}");
            Console.WriteLine($"Остаток от деления дробей {c} и {c1}. Результат: {c % c1}");

        }
    }
}
